# FizzBuzz

## 问题描述
假设有这样一个场景。你只有11岁，在下课之前的五分钟，你的数学老师决定通过一个『游戏』让课堂更『有趣』。他让同学们从1开始逐个报数。『有趣』的是，如果数字可以被3整除，就要说『Fizz』，如果可以被5整除，就说『Buzz』。现在，你的同学们开始报数了，他们开心的喊到"1!"、"2!"、"Fizz!"、"4!"、"Buzz!"...。为了避免当众出丑，你必须打印一份清单告诉你要说什么。你的班级由大概33名学生，在下课铃响之前可以会连续报数3轮。

## 现在开始写代码！
写一段程序，能够从1打印到100。不过遇到3的倍数就打印"Fizz"来代替数字，遇到5的倍数就打印"Buzz"，如果遇到3和5的倍数，就打印"FizzBuzz"。
比如：
```
1
2
Fizz
4
Buzz
Fizz
7
8
Fizz
Buzz
11
Fizz
13
14
FizzBuzz
16
17
Fizz
19
Buzz
... 直到100
```

## 新需求
```
* 如果数字可以被3整除或数位中含有3，就打印fizz
* 如果数字可以被5整除或数位中含有5，就打印buzz
```
